zero_modules = [{'name': 'static', 'name_ru': 'Короткая статика'}, {'name': 'dynamic', 'name_ru': 'Статодинамика'}]

zero_modes = {
    'static': {
        'values': ['8', '12', '16', '20', '24'],
        'weights': [10, 8, 5, 1, 1],
    },
    'dynamic': {
        'values': ['4x8', '4x12', '4x16', '8x4', '8x8', '8x12'],
        'weights': [10, 8, 1, 8, 2, 1],
    },
}

zero_games = {
    'static': [
        'ON 1',
        'ON 2',
        'ON 3',
        'ON 4',
        'ON 5',
        'ON 6',
        'ON 7',
        'ON 8',
        'ON 9',
        'ON 10',
        'ON 11',
        'ON 12',
        'ON 13',
        'ON 14',
        'ON 15',
        'ON 16',
        'ON 17',
        'ON 18',
    ],
    'dynamic': ['ZERO 1', 'ZERO 2', 'ZERO 3', 'ZERO 4', 'ZERO 5', 'ZERO 6', 'ZERO 7', 'ZERO 8', 'ZERO 9'],
}

core_practice_modules = {
    'base': {'number_of_games': 1},
    'dense': {'number_of_games': 2},
    'grand': {'number_of_games': 3},
    'mortal': {'number_of_games': 4},
}

core_practice_modes = {
    'values': ['1x8', '1x18', '2x4', '2x8', '4x2', '4x4'],
    'weights': [10, 1, 9, 6, 2, 2],
}

games_by_level = {
    'level_1': [
        'Струна',
        'Почувствуй детали',
        'Центрирование',
        'Челлендж',
        'Суставной тренаж',
        'Завихрение',
        'Спинные экзерсисы',
        'Мэнс хелз',
        'Вумэнс хелз',
        'Азы плотности',
        'Структуризация',
        'Баланс и сила',
        'Грань',
        'Интегральный',
        'Уплотнение',
        'Открытие',
        'Железно',
        'Предлог',
        'Корни',
        'Стыковка',
        'Грация',
        'Штиль',
        'Цикличность',
        'Разворот',
        'Компенсация',
        'Мирный воин',
        'Сахар',
    ],
    'level_2': [
        'Ревизия',
        'Устремление',
        'Проработка',
        'Активация центра',
        'Пробуждение силы',
        'Спонтанность',
        'Ошеломляющая безмятежность',
        'Геометрия потока',
        'Однажды',
        'Стан',
        'Пот',
        'Леер',
        'Лесенка',
        'Вязь',
        'Выход',
        'Раскинуться',
        'Сдвиг',
        'Визит',
        'Платформа',
        'Флюгер',
        'Мягкость',
        'Асимметрия',
        'Классика',
        'Орнамент',
        'Терпение',
        'Вереница',
        'Перелив №1',
    ],
}

games = {
    'level_1': games_by_level['level_1'],
    'level_2': games_by_level['level_2'],
    'level_1_and_2': [*games_by_level['level_1'], *games_by_level['level_2']],
}
